Table of Contents
 Class ResultOfIncrement
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Result of internal forces in the one position
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfIncrement
Inheritance
object
ResultOfIncrement
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AxialForce
Axial force
public double AxialForce { get; set; }
Property Value
double
 AxialStrain
Axial strain
public double AxialStrain { get; set; }
Property Value
double
 AxialStress
Axial stress
public double AxialStress { get; set; }
Property Value
double
 Increment
Increment of load case
public int Increment { get; set; }
Property Value
int
 Edit this page